<a href="https://colab.research.google.com/github/sravanirachamalla/MLA2021/blob/main/practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **Introduction to machine** **learning**

In [ ]:
var1=2
var2=5.0
var3= True
var4="machine learning"

In [ ]:
print("value of var1:", var1)
print("value of var2:", var2)
print("value of var1:", var3)
print("value of var2:", var4)

value of var1: 2
value of var2: 5.0
value of var1: True
value of var2: machine learning

In [ ]:
type(var1)

str

In [ ]:
#checking a condition if the variable value is more than 1
if var1>1:
  print("bigger than 1")

bigger than 1

In [ ]:
x=10
y=12
#if x is greater than y
if x>y:
  print("x>y")
#if x is lesser than y 
elif x<y:
  print("x<y")
else:
  print("x=y")

x<y

In [ ]:
##create an emptylist
emptylist=[]

In [ ]:
batsmen=['rohit', 'dhawan', 'kohyli', 'dhoni', 'ishaan']

In [ ]:
batsmen[0]

'rohit'

slicing data

In [ ]:
##slicing data
batsmen[0:2]

['rohit', 'dhawan']

In [ ]:
batsmen[-1]

'ishaan'

In [ ]:
#how many elemants in the list
len(batsmen)

5

In [ ]:
bowlers=['bumrah', 'shami', 'bhuvi', 'kuldeep']

In [ ]:
all_players=batsmen+bowlers

In [ ]:
all_players

['rohit',
 'dhawan',
 'kohyli',
 'dhoni',
 'ishaan',
 'bumrah',
 'shami',
 'bhuvi',
 'kuldeep']

True if exists,else return false

In [ ]:
'bumrah' in bowlers

True

In [ ]:
'dhoni' in batsmen

True

In [ ]:
##index is used to find the place in the list
all_players.index('dhoni')

5

In [ ]:
##reverse function
all_players.reverse()
all_players

['kuldeep',
 'bhuvi',
 'shami',
 'bumrah',
 'ishaan',
 'dhoni',
 'kohyli',
 'dhawan',
 'rohit']

In [ ]:
all_players.index('dhoni')

5

In [ ]:
##tuple cannot be changed as the list above, once done is not immutable
players=tuple(all_players)

In [ ]:
players

('kuldeep',
 'bhuvi',
 'shami',
 'bumrah',
 'ishaan',
 'dhoni',
 'kohyli',
 'dhawan',
 'rohit')

In [ ]:
##set is collection of elements that values cannot be repeated with flower brackets
setofnumbers={6,1,1,3,4,4,5}

In [ ]:
setofnumbers

{1, 3, 4, 5, 6}

In [ ]:
bp2011={'sweety', 'sreya', 'bunty', 'milky', 'goldy', 'dolly', 'puppy'}
bp2015={'goldy', 'beauty', 'minty', 'puppy', 'dolly', 'sweety', 'bunty'}

In [ ]:
bp2011.union(bp2015)

{'beauty',
 'bunty',
 'dolly',
 'goldy',
 'milky',
 'minty',
 'puppy',
 'sreya',
 'sweety'}

In [ ]:
bp2011.intersection(bp2015)

{'bunty', 'dolly', 'goldy', 'puppy', 'sweety'}

In [ ]:
bp2015.difference(bp2011)

{'beauty', 'minty'}

In [ ]:
##dealing with strings
string0='python'
string1="machine learning"
string3="""this is a multiline string"""

In [ ]:
string0.upper()

'PYTHON'

In [ ]:
###splitting the string
tokens=string1.split(' ')
tokens

['machine', 'learning']

In [ ]:
tokens=string3.split(" ")
tokens

['this', 'is', 'a', 'multiline', 'string']

# **Descriptive analysis**

In [3]:
print('welcome')

welcome

In [4]:
import pandas as pd

In [6]:
pd.read_csv?

In [13]:
ipl_df=pd.read_csv('https://raw.githubusercontent.com/sravanirachamalla/MLA2021/main/Data/IPL%20IMB381IPL2013.csv')

In [14]:
type(ipl_df)

pandas.core.frame.DataFrame

In [17]:
##displaying first few records of the dataframe
pd.set_option('display.max_columns', 10)

In [18]:
ipl_df.head(5)

,Sl.NO.,PLAYER NAME,AGE,COUNTRY,TEAM,...,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
0,1,"Abdulla, YA",2,SA,KXIP,...,8.90,13.93,2009,50000,50000
1,2,Abdur Razzak,2,BAN,RCB,...,14.50,0.00,2008,50000,50000
2,3,"Agarkar, AB",2,IND,KKR,...,8.81,24.90,2008,200000,350000
3,4,"Ashwin, R",1,IND,CSK,...,6.23,22.14,2011,100000,850000
4,5,"Badrinath, S",2,IND,CSK,...,0.00,0.00,2011,100000,800000

In [19]:
##Finding the summary of the dataframe
list(ipl_df.columns)

['Sl.NO.',
 'PLAYER NAME',
 'AGE',
 'COUNTRY',
 'TEAM',
 'PLAYING ROLE',
 'T-RUNS',
 'T-WKTS',
 'ODI-RUNS-S',
 'ODI-SR-B',
 'ODI-WKTS',
 'ODI-SR-BL',
 'CAPTAINCY EXP',
 'RUNS-S',
 'HS',
 'AVE',
 'SR-B',
 'SIXERS',
 'RUNS-C',
 'WKTS',
 'AVE-BL',
 'ECON',
 'SR-BL',
 'AUCTION YEAR',
 'BASE PRICE',
 'SOLD PRICE']

In [21]:
##to convert rows to columns and viceversa
ipl_df.head(5).transpose()

                         0             1            2          3             4
Sl.NO.                   1             2            3          4             5
PLAYER NAME    Abdulla, YA  Abdur Razzak  Agarkar, AB  Ashwin, R  Badrinath, S
AGE                      2             2            2          1             2
COUNTRY                 SA           BAN          IND        IND           IND
TEAM                  KXIP           RCB          KKR        CSK           CSK
PLAYING ROLE    Allrounder        Bowler       Bowler     Bowler       Batsman
T-RUNS                   0           214          571        284            63
T-WKTS                   0            18           58         31             0
ODI-RUNS-S               0           657         1269        241            79
ODI-SR-B                 0         71.41        80.62      84.56         45.93
ODI-WKTS                 0           185          288         51             0
ODI-SR-BL                0          37.6         32.9       36.8             0
CAPTAINCY EXP            0             0            0          0             0
RUNS-S                   0             0          167         58          1317
HS                       0             0           39         11            71
AVE                      0             0        18.56        5.8         32.93
SR-B                     0             0       121.01      76.32        120.71
SIXERS                   0             0            5          0            28
RUNS-C                 307            29         1059       1125             0
WKTS                    15             0           29         49             0
AVE-BL               20.47             0        36.52      22.96             0
ECON                   8.9          14.5         8.81       6.23             0
SR-BL                13.93             0         24.9      22.14             0
AUCTION YEAR          2009          2008         2008       2011          2011
BASE PRICE           50000         50000       200000     100000        100000
SOLD PRICE           50000         50000       350000     850000        800000

In [22]:
##to determine the dimension andf shape of the df
ipl_df.shape

(130, 26)

In [23]:
##more information about the dataset
ipl_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 130 entries, 0 to 129
Data columns (total 26 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sl.NO.         130 non-null    int64
 1   PLAYER NAME    130 non-null    object
 2   AGE            130 non-null    int64
 3   COUNTRY        130 non-null    object
 4   TEAM           130 non-null    object
 5   PLAYING ROLE   130 non-null    object
 6   T-RUNS         130 non-null    int64
 7   T-WKTS         130 non-null    int64
 8   ODI-RUNS-S     130 non-null    int64
 9   ODI-SR-B       130 non-null    float64
 10  ODI-WKTS       130 non-null    int64
 11  ODI-SR-BL      130 non-null    float64
 12  CAPTAINCY EXP  130 non-null    int64
 13  RUNS-S         130 non-null    int64
 14  HS             130 non-null    int64
 15  AVE            130 non-null    float64
 16  SR-B           130 non-null    float64
 17  SIXERS         130 non-null    int64
 18  RUNS-C         130 non-null    int64
 19  WKTS           130 non-null    int64
 20  AVE-BL         130 non-null    float64
 21  ECON           130 non-null    float64
 22  SR-BL          130 non-null    float64
 23  AUCTION YEAR   130 non-null    int64
 24  BASE PRICE     130 non-null    int64
 25  SOLD PRICE     130 non-null    int64
dtypes: float64(7), int64(15), object(4)
memory usage: 26.5+ KB

In [24]:
#slicing and indexing of df- to choose selected columns and rows
ipl_df[0:5]

,Sl.NO.,PLAYER NAME,AGE,COUNTRY,TEAM,...,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
0,1,"Abdulla, YA",2,SA,KXIP,...,8.90,13.93,2009,50000,50000
1,2,Abdur Razzak,2,BAN,RCB,...,14.50,0.00,2008,50000,50000
2,3,"Agarkar, AB",2,IND,KKR,...,8.81,24.90,2008,200000,350000
3,4,"Ashwin, R",1,IND,CSK,...,6.23,22.14,2011,100000,850000
4,5,"Badrinath, S",2,IND,CSK,...,0.00,0.00,2011,100000,800000

In [26]:
ipl_df[-5:]

,Sl.NO.,PLAYER NAME,AGE,COUNTRY,TEAM,...,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
125,126,"Yadav, AS",2,IND,DC,...,0.00,0.00,2010,50000,750000
126,127,Younis Khan,2,PAK,RR,...,0.00,0.00,2008,225000,225000
127,128,Yuvraj Singh,2,IND,KXIP+,...,7.02,21.13,2011,400000,1800000
128,129,Zaheer Khan,2,IND,MI+,...,7.75,21.26,2008,200000,450000
129,130,"Zoysa, DNT",2,SL,DC,...,9.00,33.00,2008,100000,110000

In [27]:
ipl_df['PLAYER NAME'][0:5]

0     Abdulla, YA
1    Abdur Razzak
2     Agarkar, AB
3       Ashwin, R
4    Badrinath, S
Name: PLAYER NAME, dtype: object

In [30]:
ipl_df[['PLAYER NAME','COUNTRY']][0:5]

    PLAYER NAME COUNTRY
0   Abdulla, YA      SA
1  Abdur Razzak     BAN
2   Agarkar, AB     IND
3     Ashwin, R     IND
4  Badrinath, S     IND

In [31]:
##Specific rows and colums
ipl_df.iloc[4:9, 1:4]

     PLAYER NAME  AGE COUNTRY
4   Badrinath, S    2     IND
5     Bailey, GJ    2     AUS
6      Balaji, L    2     IND
7  Bollinger, DE    2     AUS
8       Botha, J    2      SA

In [32]:
#Value counts and cross tabulations- occurence of each unique value
ipl_df.COUNTRY.value_counts()

IND    53
AUS    22
SA     16
SL     12
PAK     9
NZ      7
WI      6
ENG     3
BAN     1
ZIM     1
Name: COUNTRY, dtype: int64

In [33]:
##normalizes is used to measure the percentage of occurence 
ipl_df.COUNTRY.value_counts(normalize=True)*100

IND    40.769231
AUS    16.923077
SA     12.307692
SL      9.230769
PAK     6.923077
NZ      5.384615
WI      4.615385
ENG     2.307692
BAN     0.769231
ZIM     0.769231
Name: COUNTRY, dtype: float64

In [34]:
#crosstabulation for the combination of values of two columns
pd.crosstab(ipl_df['AGE'], ipl_df['PLAYING ROLE'])

PLAYING ROLE  Allrounder  Batsman  Bowler  W. Keeper
AGE
1                      4        5       7          0
2                     25       21      29         11
3                      6       13       8          1

In [39]:
#Sorting data frames by column values- default by ascending order
ipl_df[['PLAYER NAME', 'SOLD PRICE']].sort_values ('SOLD PRICE') [0:5]

       PLAYER NAME  SOLD PRICE
73      Noffke, AA       20000
46     Kamran Khan       24000
0      Abdulla, YA       50000
1     Abdur Razzak       50000
118  Van der Merwe       50000

In [40]:
##For descending order
ipl_df[['PLAYER NAME', 'SOLD PRICE']].sort_values ('SOLD PRICE', ascending=False) [0:5]

       PLAYER NAME  SOLD PRICE
93       Sehwag, V     1800000
127   Yuvraj Singh     1800000
50        Kohli, V     1800000
111  Tendulkar, SR     1800000
113     Tiwary, SS     1600000

In [ ]:
##creating new columns